<?php

namespace App\Controller;

use App\Model\TelegramBot;

class BusinessController
{
    private TelegramBot $app;

    public function __construct(TelegramBot $app)
    {
        $this->app = $app;
    }

    public function index()
    {
        $menu = [
            [
                ['text' => '⬅ Вернуться назад', 'callback_data' => 'Home_index'],
            ]
        ];

        $this->app->editMessage(
            "📍 Расположение бизнесов:\n" .
            "\n" .
            "🏢 Расположение - 🗺️ Бизнесов\n" .
            "📄 24/7 (3) - Южный (Телебашня)\n" .
            "24/7 (6) - Батырево\n" .
            "24/7 (8) - Арзамас\n" .
            "24/7 (10) - Перекресток\n" .
            "24/7 (13) - Клады Арзамас\n" .
            "24/7 (15) - Батырево\n" .
            "24/7 (16) АЗС Гарель - Батырево\n" .
            "24/7 (18) - Южный (Банк)\n" .
            "24/7 (20) - УМВД\n" .
            "24/7 (21) - СМИ\n" .
            "24/7 (22) - АЗС Низкий автосалон\n" .
            "24/7 (23) - Арзамас (Тех. Центр)\n" .
            "24/7 (24) - Лыткарино (ФСБ)\n" .
            "24/7 (25) - АЗС Корякино\n" .
            "24/7 (26) - АЗС Клады Батырево\n" .
            "24/7 (36) - АЗС Егоровка\n" .
            "24/7 (39) - АЗС Южный\n" .
            "24/7 (40) - АЗС Казино\n" .
            "24/7 (57) - ЖК Видный Башни Азбука Вкуса\n" .
            "24/7 (58) - ЖК Видный Пятерочка\n" .
            "24/7 (63) - Бусаево\n" .
            "24/7 (64) - АЗС Лыткарино\n" .
            "24/7 (66) - Лыткарино (Банк)\n" .
            "24/7 (71) - Горки\n" .
            "24/7 (82) - Корякино\n" .
            "\n" .
            "АЗС (0) - Южный\n" .
            "АЗС (1) - Низкий\n" .
            "АЗС (2) - Охота\n" .
            "АЗС (3) - Корякино\n" .
            "АЗС (4) - Бат. Клады\n" .
            "АЗС (5) - Егоровка\n" .
            "АЗС (6) - Лыткарино\n" .
            "АЗС (7) - Над казино\n" .
            "АЗС (8) - Водная\n" .
            "\n" .
            "Закусочная (2) - Южный (Телебашня)\n" .
            "Закусочная (4) - Батырево (Военкомат)\n" .
            "Закусочная (7) - Батырево (ВЧ)\n" .
            "Закусочная (11) - Арзамас\n" .
            "Закусочная (12) - Арзамас (перекрёсток)\n" .
            "Закусочная (17) - Спавн Арзамас (Старый)\n" .
            "Закусочная (37) - Егоровка\n" .
            "Закусочная (68) - Лыткарино\n" .
            "\n" .
            "Одежда (1) - Южный\n" .
            "Одежда (5) - Бытырево\n" .
            "Одежда (9) - Арзамас\n" .
            "Одежда (56) - ЖК Башни\n" .
            "Одежда (67) - Лыткарино\n" .
            "Одежда (72) - Горки\n" .
            "\n" .
            "Ларёк (42) - Остановка спана Арзамас (Страый)\n" .
            "Ларёк (43) - Остановка спавна Арзамас (Стрый)\n" .
            "Ларёк (44) - Остановка Арзамаса (Возле Перекрёстка)\n" .
            "Ларёк (45) - Остановка Арзамаса ( Башни Строй. Компаний)\n" .
            "Ларёк (46) - Больница Арзамаса\n" .
            "Ларёк (47) - Спавн Лыткарино\n" .
            "Ларёк (48) - Спавн Батырево\n" .
            "Ларёк (50) - Спавн Южного\n" .
            "Ларек (51) - Остановка Южного (банк)\n" .
            "Ларёк (52) - Остановка Южного\n" .
            "Ларёк (53) - ГИБДД 1\n" .
            "Ларёк (54) - ГИБДД 2\n" .
            "Ларёк (55) - Спавн Арзамас\n" .
            "Ларёк (70) - Больница Лыткарино\n" .
            "Ларёк (74) - Горки\n" .
            "\n" .
            "Аксессуары (31) - Южный\n" .
            "Аксессуары (32) - Арзамас\n" .
            "Аксессуары (69) - Лыткарино\n" .
            "Аксессуары (77) - Батырево\n" .
            "\n" .
            "Амуниция (14) - Арзамас\n" .
            "Амуниция (19) - Южный\n" .
            "Амуниция (65) - Лыткарино\n" .
            "Амуниция (73) - Горки\n" .
            "Амуниция (76) -Батырево\n" .
            "\n" .
            "Рыболовный магазин (78) - Южный\n" .
            "Рыболовный магазин (79) - Арзамас\n" .
            "Рыболовный магазин (80) - Батырево\n" .
            "Рыболовный магазин (81) - Лыткарино\n" .
            "\n" .
            "Таксопарк 'Яндекс Такси' (59) - Южный (/gps 8 - 1)\n" .
            "Таксопарк 'Gett' (61) - Арзамас (/gps 8-2)\n" .
            "Таксопарк 'СитиМобил' (60) - Батырево (/gps 8-3)\n" .
            "\n" .
            "Автосалон Низкого Класса (0) - Гарель (/gps 11-1)\n" .
            "Автосалон Среднего Класса (27) - Арзамас (/gps 11-2)\n" .
            "Автосалон Высокого Класса (28) - Арзамас (/gps 11-3)\n" .
            "Салон Грузовых Автомобилей (38) - Арзамас (/gps 11-4)\n" .
            "Мотосалон 'Harley Davidson' (41) - Арзамас (/gps 11-5)\n" .
            "Лодочный салон (75) - (/gps 11-6)\n" .
            "\n" .
            "Казино (30) - Батырево ( /gps 9-1)\n" .
            "Клуб 'Moon' (62) - Арзамас (gps 9-4)\n" .
            "\n" .
            "СТО (29) - Арзамас (/gps 12-1)\n" .
            "Стайлинг-Центр (33) - Южный (/gps 12-2)\n" .
            "Шиномонтажный Центр (34) - Батырево (/gps 12-3)\n" .
            "Технический Центр (35) - Арзамас (/gps 12-4)",
            null,
            $menu
        );
    }
}
